nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mz1024ecg100.h
PLIB_INLINE_API void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index)
{
     ETH_RxBufferCountDecrement_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxBufferCountDecrement(ETH_MODULE_ID index)
{
     return ETH_ExistsRxBufferCountDecrement_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index)
{
     return ETH_ReceiveBufferSizeGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize)
{
     ETH_ReceiveBufferSizeSet_Default(index, ReceiveBufferSize);
}

PLIB_INLINE_API int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index, int rxBuffSize)
{
     return ETH_RxSetBufferSize_Default(index, rxBuffSize);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveBufferSize(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveBufferSize_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t* txPacketDescStartAddr)
{
     ETH_TxPacketDescAddrSet_Default(index, txPacketDescStartAddr);
}

PLIB_INLINE_API uint8_t* PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index)
{
     return ETH_TxPacketDescAddrGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsTxPacketDescriptorAddress(ETH_MODULE_ID index)
{
     return ETH_ExistsTxPacketDescriptorAddress_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t* rxPacketDescStartAddr)
{
     ETH_RxPacketDescAddrSet_Default(index, rxPacketDescStartAddr);
}

PLIB_INLINE_API uint8_t* PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index)
{
     return ETH_RxPacketDescAddrGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxPacketDescriptorAddress(ETH_MODULE_ID index)
{
     return ETH_ExistsRxPacketDescriptorAddress_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue)
{
     ETH_HashTableSet_Default(index, hashTableValue);
}

PLIB_INLINE_API uint32_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index)
{
     return ETH_HashTableGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersHTSet(ETH_MODULE_ID index, uint64_t htable)
{
     ETH_RxFiltersHTSet_Default(index, htable);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsHashTable(ETH_MODULE_ID index)
{
     return ETH_ExistsHashTable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PatternMatchSet(ETH_MODULE_ID index, uint64_t patternMatchMaskValue)
{
     ETH_PatternMatchSet_Default(index, patternMatchMaskValue);
}

PLIB_INLINE_API uint64_t PLIB_ETH_PatternMatchGet(ETH_MODULE_ID index)
{
     return ETH_PatternMatchGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PatternMatchChecksumSet(ETH_MODULE_ID index, uint16_t PatternMatchChecksumValue)
{
     ETH_PatternMatchChecksumSet_Default(index, PatternMatchChecksumValue);
}

PLIB_INLINE_API uint16_t PLIB_ETH_PatternMatchChecksumGet(ETH_MODULE_ID index)
{
     return ETH_PatternMatchChecksumGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PatternMatchOffsetSet(ETH_MODULE_ID index, uint16_t PatternMatchOffsetValue)
{
     ETH_PatternMatchOffsetSet_Default(index, PatternMatchOffsetValue);
}

PLIB_INLINE_API uint16_t PLIB_ETH_PatternMatchOffsetGet(ETH_MODULE_ID index)
{
     return ETH_PatternMatchOffsetGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PatternMatchModeSet(ETH_MODULE_ID index, ETH_PATTERN_MATCH_MODE modeSel)
{
     ETH_PatternMatchModeSet_Default(index, modeSel);
}

PLIB_INLINE_API ETH_PATTERN_MATCH_MODE PLIB_ETH_PatternMatchModeGet(ETH_MODULE_ID index)
{
     return ETH_PatternMatchModeGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersPMClr(ETH_MODULE_ID index)
{
     ETH_RxFiltersPMClr_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsPatternMatch(ETH_MODULE_ID index)
{
     return ETH_ExistsPatternMatch_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersPMSet(ETH_MODULE_ID index, ETH_PMATCH_MODE mode, uint64_t matchMask, uint32_t matchOffs, uint32_t matchChecksum)
{
     ETH_RxFiltersPMSet_Default(index, mode, matchMask, matchOffs, matchChecksum);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxFiltersPMSet(ETH_MODULE_ID index)
{
     return ETH_ExistsRxFiltersPMSet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveFilterEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     ETH_ReceiveFilterEnable_Default(index, filter);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveFilterDisable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     ETH_ReceiveFilterDisable_Default(index, filter);
}

PLIB_INLINE_API bool PLIB_ETH_ReceiveFilterIsEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     return ETH_ReceiveFilterIsEnable_Default(index, filter);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersSet(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     ETH_RxFiltersSet_Default(index, rxFilters);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersClr(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     ETH_RxFiltersClr_Default(index, rxFilters);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersWrite(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     ETH_RxFiltersWrite_Default(index, rxFilters);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveFilters(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveFilters_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
     ETH_RxFullWmarkSet_Default(index, watermarkValue);
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index)
{
     return ETH_RxFullWmarkGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
     ETH_RxEmptyWmarkSet_Default(index, watermarkValue);
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index)
{
     return ETH_RxEmptyWmarkGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveWmarks(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveWmarks_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSourceEnable_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSourceDisable_Default(index, intmask);
}

PLIB_INLINE_API bool PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return ETH_InterruptSourceIsEnabled_Default(index, intmask);
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index)
{
     return ETH_InterruptSourcesGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSet_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptClear_Default(index, intmask);
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)
{
     return ETH_InterruptsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return ETH_InterruptStatusGet_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_EventsEnableSet(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableSet_Default(index, eEvents);
}

